In [59]:
import seaborn as sns
import pandas as pd

In [23]:
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','fare']]

In [24]:
df=titanic.loc[:,['age','fare']]

In [15]:
df['ten']=10
df.head()

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [40]:
def add_10(n):
    return n+10

def add_two_obj(a,b):
    return a+b

In [12]:
sr1=df['age'].apply(add_10)

In [14]:
sr1.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [16]:
sr2=df['age'].apply(add_two_obj,b=10)

In [18]:
sr2.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [19]:
sr3=df['age'].apply(lambda x: add_10(x))

In [21]:
sr3.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [26]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [27]:
df_map=df.applymap(add_10)

In [29]:
def missing_value(series):
    return series.isnull()

In [30]:
result=df.apply(missing_value,axis=0)

In [32]:
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [31]:
result

       age   fare
0    False  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

[891 rows x 2 columns]

In [35]:
def min_max(x):
    return x.max()-x.min()

In [47]:
result2=df.apply(min_max)

In [48]:
result2

age      79.5800
fare    512.3292
ten       0.0000
add      79.5800
dtype: float64

In [44]:
df['ten']=10
df['add']=df.apply(lambda x: add_two_obj(x['age'],x['ten']),axis=1)

In [46]:
df.head(10)

    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0
5   NaN   8.4583   10   NaN
6  54.0  51.8625   10  64.0
7   2.0  21.0750   10  12.0
8  27.0  11.1333   10  37.0
9  14.0  30.0708   10  24.0

In [49]:
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','fare']]

In [51]:
def missing_value(x):
    return x.isnull()

def missing_count(x):
    return missing_value(x).sum()

def total_number_missing(x):
    return missing_count(x).sum()

In [53]:
df.head(10)

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
7   2.0  21.0750
8  27.0  11.1333
9  14.0  30.0708

In [52]:
result_df=df.pipe(missing_value)

In [55]:
result_df.head(10)

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5   True  False
6  False  False
7  False  False
8  False  False
9  False  False

In [56]:
df.pipe(missing_count)

age     177
fare      0
dtype: int64

In [57]:
df.pipe(total_number_missing)

177

In [60]:
df_sample = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [6, 7, 8, 9, 10]})

In [61]:
df_sample

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [62]:
def add_two(x):
    return x+2

def mul_3(x):
    return x*3

In [63]:
df_sample.pipe(add_two).pipe(mul_3)

    A   B
0   9  24
1  12  27
2  15  30
3  18  33
4  21  36

In [64]:
df=titanic.loc[0:4,'survived':'age']

In [65]:
df

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [68]:
columns=list(df.columns.values)

In [70]:
columns_sorted=sorted(columns)

In [71]:
columns_sorted

['age', 'pclass', 'sex', 'survived']

In [73]:
df_sorted=df[columns_sorted]

In [75]:
df

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [74]:
df_sorted

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [78]:
columns_reversed=list(reversed(columns))

In [77]:
columns_reversed

['age', 'sex', 'pclass', 'survived']

In [79]:
df_reversed=df[columns_reversed]

In [81]:
df

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [80]:
df_reversed

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

In [84]:
customed=['pclass','sex','age','survived']

In [85]:
df_customed=df[customed]

In [86]:
df_customed

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0